# สมมติว่านักศึกษาแอบชอบคนๆหนึ่งอยู่ โดยที่นักศึกษาและคนๆนั้นจะมีกิจกรรมและสถานที่ที่ไปแตกต่างกันในแต่ละวัน
# ให้นักศึกษาเขียนโปรแกรมที่จะหาว่าสิ่งที่นักศึกษาและคนๆนั้นทำในแต่ละวันจะทำให้ได้คบกันหรือไม่ โดยใช้ Queue

# กิจกรรม                                       สถานที่
# 0 = กินข้าว(Eat)                           0 = ร้านอาหาร(Res.)
# 1 = เล่นเกม(Game)                      1 = ห้องเรียน(ClassR.)
# 2 = ทำโจทย์ datastruc(Learn)      2 = ห้างสรรพสินค้า(SuperM.)
# 3 = ดูหนัง(Movie)                        3 = บ้าน(Home)

# โดยการรับ Input จะประกอบด้วย

# กิจกรรม:สถานที่(ของนักศึกษาและของคนๆนั้น) โดยในแต่ละวันจะคั่นด้วยเครื่องหมาย ,

# เช่น วันที่ 1 นักศึกษาไปกินข้าวที่ร้านอาหาร และ คนๆนั้นไปนั่งทำโจทย์ datastruc ที่ร้านอาหาร 
#        วันที่ 2 นักศึกษาไปเล่นเกมที่บ้าน และ คนๆนั้นไปดูหนังที่ห้างสรรพสินค้า
# จะได้ว่า 0:0 2:0,1:3 3:2

# ***มีการคิดคะแนนดังนี้***

# ·       กิจกรรมเดียวกันแต่คนละสถานที่         +1

# ·       สถานที่เดียวกันแต่ทำกิจกรรมต่างกัน    +2

# ·       กิจกรรมเดียวกันและสถานที่เดียวกัน    +4

# ·       ไม่เหมือนกันเลย                                   - 5

# หากมีคะแนนมากกว่าหรือเท่ากับ 7 จะถือว่าได้คบกัน แต่ถ้าคะแนนน้อยกว่า 7 แต่มากกว่า 0 เป็นคนคุย น้อยกว่านั้นถือว่าเป็นได้แค่เพื่อน

# โดยในแต่ละขั้นตอนให้แสดงผลดังตัวอย่าง